class Basket {
  constructor() {
    // Массив объектов с товарами корзины
    this.goods = [];
  }

  //Метод для подсчета количества товаров в корзине
  getGoodsNumber() {}

  //Метод для подсчета стоимости корзины
  getBasketCost() {}

  //Метод для добавления товара в корзину
  addGood() {}

  //Метод для удаления товара из корзины
  deleteGood() {}

  //Метод для изменения количества выбранного товара
  changeGoodsQuantity() {}

  //Метод для создания HTML разметки корзины
  render() {}
}